astb_relise/src/DataProcessors/ПодборНоменклатурыВыдачи/ПодборНоменклатурыВыдачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПодборНоменклатурыВыдачи</name>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаВыдачи</name>
    <type>
      <types>CatalogRef.НормыВыдачиСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураНормы</name>
    <type>
      <types>CatalogRef.НоменклатураНормОрганизации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПодобраннаяНоменклатура</name>
    <attributes>
      <name>НоменклатураНормы</name>
      <type>
        <types>CatalogRef.НоменклатураНормОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

astb_relise/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/Enums/ВидыОперацийКомплектации/ВидыОперацийКомплектации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийКомплектации</name>
  <enumValues>
    <name>Комплектация</name>
  </enumValues>
  <enumValues>
    <name>Разукомплектация</name>
  </enumValues>
</mdclass:Enum>

astb_relise/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <comment>Организации</comment>
  <attributes>
    <name>ДискретностьРасчетаПроцентаИзноса</name>
    <type>
      <types>EnumRef.ДоступныеПериодыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоНоменклатуреДляПечатныхФорм</name>
    <type>
      <types>EnumRef.ВидДополнительнойИнформацииПоНоменклатуре</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьАлгоритм_0_0_0_3</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьАлгоритм_0_0_0_4</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьАлгоритм_0_1_0_3</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьАлгоритм_0_0_1_2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьАлгоритм_1_0_1_1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьГруппыИЛИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИзменятьСрокНоскиВыданныхСИЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СверткаПотребностиПоНоменклатуреНормы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастичнаяВыдача</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПредварительныеЗаявкиНаКоллективнуюВыдачу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроцентИзноса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРабочиеМеста</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьКоличествоСтавокПоШтатномуРасписанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьКоличествоЦикловЧисткиСИЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеЗначениеШтрихкода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаАдресацииМестХраненияСИЗ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеАлгоритмаФормированияПотребности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьДатуОкончанияСрокаНоскиНаЭтикетках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеВнешнегоПользователя</name>
    <type>
      <types>EnumRef.ПредставлениеВнешнегоПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксШтрихкодаНоменклатуры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьДоступСотрудникамКБазе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SMSИнформированиеОВозвратеИзЧистки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SMSИнформированиеОПолученииСредствЗащиты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SMSИнформированиеОПоступленииНаСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SMSШаблонОВозвратеИзЧистки</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>SMSШаблонОПолученииСредствЗащиты</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>SMSШаблонОПоступленииНаСклад</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailИнформированиеОВозвратеИзЧистки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailИнформированиеОПолученииСредствЗащиты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailИнформированиеОПоступленииНаСклад</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailШаблонОВозвратеИзЧистки</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailШаблонОПолученииСредствЗащиты</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailШаблонОПоступленииНаСклад</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОценкуСервисногоОбслуживания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналСбытаSAP</name>
    <type>
      <types>EnumRef.КаналыСбытаSAP</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходПраваСобственностиПоПредварительнойЗаявкеППС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеППСприКоллективнойВыдаче</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиксироватьВыдачуСверхНорм</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключитьТолькоОсновныеУсловияНорм</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПоУмолчанию</name>
    <comment>Склад по-умолчанию для подстановки в документы</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеДляОбменаССАП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыДеятельности</name>
    <attributes>
      <name>ВидДеятельности</name>
      <type>
        <types>CatalogRef.ВидыЭкономическойДеятельности</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

astb_relise/src/DataProcessors/ПодборНоменклатурыВыдачи/Forms/ФормаПодбораКомплектов/Module.bsl
&НаКлиенте
Перем ПереноситьВДокумент;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Документ = Неопределено Тогда
		ВызватьИсключение НСтр("ru='Предусмотрено открытие обработки только из документов.'");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметры.Организация) Тогда
		Сообщить(НСтр("ru='В документе не заполнена организация.'"));
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметры.Склад) Тогда
		Сообщить(НСтр("ru='В документе не заполнен склад.'"));
		Отказ = Истина;
	КонецЕсли;
		
	Элементы.ТолькоВНаличии.Заголовок = "Только в наличии на складе: " + СокрЛП(Параметры.Склад.Наименование);
	
	ТаблицаДокумента = ПолучитьИзВременногоХранилища(Параметры.АдресВременногоХранилищаТаблицы);
	
	Объект.ПодобраннаяНоменклатура.Загрузить(ТаблицаДокумента);
	
	УстановитьПараметрыОтбораНаСервере();
	
	ВосстановитьНастройкиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиФормы()
	//не имеет смысла для этой формы
	//Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Обработка_ПодборНоменклатураВыдачи_ФормаПодбораКомплектов");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыОтбораНаСервере()
	
	Если ПолучитьФункциональнуюОпцию("НеВестиУчетОстатковНоменклатурыПоОрганизации") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокНоменклатуры,		"ОрганизацияДляОстатков",	Справочники.Организации.ПустаяСсылка(),	Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокХарактеристик,	"ОрганизацияДляОстатков",	Справочники.Организации.ПустаяСсылка(),	Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокНоменклатуры,		"ОрганизацияДляОстатков",	Параметры.Организация,	Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокХарактеристик,	"ОрганизацияДляОстатков",	Параметры.Организация,	Истина);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокНоменклатуры,		"Период",		ТекущаяДата(),			Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокНоменклатуры,		"Склад",		Параметры.Склад,		Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокНоменклатуры,		"Организация",	Параметры.Организация,	Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокХарактеристик,	"Организация",	Параметры.Организация,	Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокХарактеристик,	"Период",		ТекущаяДата(),			Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокХарактеристик,	"Склад",		Параметры.Склад,		Истина);
	
	Если ЗначениеЗаполнено(Параметры.Поставщик) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокНоменклатуры,"Поставщик",	Параметры.Поставщик,		Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокНоменклатуры,"Поставщик",	ПолучитьСписокПоставщиков(),Истина);
	КонецЕсли;
	
	//--АСТБ-_Овсянников_---------------------------------------------------------------------------------
	Если ПолучитьФункциональнуюОпцию("НеВестиУчетОстатковНоменклатурыПоОрганизации") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокКомплектующих,	"ОрганизацияДляОстатков",	Справочники.Организации.ПустаяСсылка(),	Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокХарактеристикКомплектующих,	"ОрганизацияДляОстатков",	Справочники.Организации.ПустаяСсылка(),	Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокКомплектующих,    "ОрганизацияДляОстатков",	Параметры.Организация,	Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокХарактеристикКомплектующих,	"ОрганизацияДляОстатков",	Параметры.Организация,	Истина);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокКомплектующих,		"Период",		ТекущаяДата(),			Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокКомплектующих,		"Склад",		Параметры.Склад,		Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокКомплектующих,		"Организация",	Параметры.Организация,	Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокХарактеристикКомплектующих,		"Период",		ТекущаяДата(),			Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокХарактеристикКомплектующих,		"Склад",		Параметры.Склад,		Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокХарактеристикКомплектующих,		"Организация",	Параметры.Организация,	Истина);
		
	Если Параметры.ОперацияКомплектации = Перечисления.ВидыОперацийКомплектации.Комплектация Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокНоменклатуры,"Комплект",	Истина,		Истина);
	Иначе	
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ЭтаФорма.СписокНоменклатуры,"Комплект",	Ложь,		Истина);
	КонецЕсли
	//--АСТБ-_Овсянников_---------------------------------------------------------------------------------
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПоставщиков()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Поставщики.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Поставщики
	|ГДЕ
	|	Поставщики.ЭтоГруппа = ЛОЖЬ";
	
	Возврат запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	
	
КонецФункции

&НаКлиенте
Процедура СписокНоменклатурыПриАктивизацииСтроки(Элемент)
	
	Если ЭтаФорма.Элементы.СписокНоменклатуры.ТекущаяСтрока = Неопределено Тогда
		ТекущаяНоменклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.СписокХарактеристик.Отбор, "Владелец", ТекущаяНоменклатура,ВидСравненияКомпоновкиДанных.Равно, "Владелец", Истина);
	Иначе
		Если ЗначениеЗаполнено(ЭтаФорма.Элементы.СписокНоменклатуры.ТекущаяСтрока) Тогда
			ТекущаяНоменклатура = ЭтаФорма.Элементы.СписокНоменклатуры.ТекущаяСтрока;
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.СписокХарактеристик.Отбор, "Владелец", ТекущаяНоменклатура,ВидСравненияКомпоновкиДанных.Равно, "Владелец", Истина);
		Иначе
			ТекущаяНоменклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.СписокХарактеристик.Отбор, "Владелец", ТекущаяНоменклатура,ВидСравненияКомпоновкиДанных.Равно, "Владелец", Ложь);
		КонецЕсли;
	КонецЕсли;
	
	ЭтаФорма.ТекущаяНоменклатура = ТекущаяНоменклатура;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ПереноситьВДокумент = Истина;	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СохранитьНастройкиФормыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиФормыНаСервере()
	
	//ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Обработка_ПодборНоменклатураВыдачи_ФормаПодбораКомплектов", , Новый Структура("ТекКомплектующее,ТекКомплект,ТекущаяНоменклатура",ЭтаФорма.ТекКомплектующее, ЭтаФорма.ТекКомплект, ЭтаФорма.ТекущаяНоменклатура));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПереноситьВДокумент = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если ПереноситьВДокумент Тогда
		
		АдресРезультатаПодбораВХранилище = ПоместитьРезультатыПодбораВХранилище(Не Элементы.СписокНоменклатуры.ТекущиеДанные.Свойство("Цена"));
		
		Структура = Новый Структура("АдресРезультатаПодбораВХранилище", АдресРезультатаПодбораВХранилище);
		ОповеститьОВыборе(Структура);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьРезультатыПодбораВХранилище(РассчитыватьЦены)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	Если РассчитыватьЦены ТОгда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДляВыгрузки.НоменклатураНормы КАК НоменклатураНормы,
		|	ТаблицаДляВыгрузки.Номенклатура КАК Номенклатура,
		|	ТаблицаДляВыгрузки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТаблицаДляВыгрузки.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ТаблицаДляВыгрузки
		|ИЗ
		|	&ТаблицаДляВыгрузки КАК ТаблицаДляВыгрузки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена
		|ПОМЕСТИТЬ ВТ_ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ПериодАнализа, Организация = &Организация) КАК ЦеныНоменклатурыСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДляВыгрузки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ТаблицаДляВыгрузки.Номенклатура КАК Номенклатура,
		|	ВТ_ТаблицаДляВыгрузки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВТ_ТаблицаДляВыгрузки.Количество КАК Количество,
		|	ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) КАК Цена,
		|	ВТ_ТаблицаДляВыгрузки.Количество * ЕСТЬNULL(ВТ_ЦеныНоменклатуры.Цена, 0) КАК Сумма
		|ИЗ
		|	ВТ_ТаблицаДляВыгрузки КАК ВТ_ТаблицаДляВыгрузки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
		|		ПО ВТ_ТаблицаДляВыгрузки.Номенклатура = ВТ_ЦеныНоменклатуры.Номенклатура";
		
		Запрос.УстановитьПараметр("ТаблицаДляВыгрузки",	ТекущийОбъект.ПодобраннаяНоменклатура.Выгрузить());
		Запрос.УстановитьПараметр("ПериодАнализа",		ТекущаяДата());
		Запрос.УстановитьПараметр("Организация",		ЭтаФорма.Параметры.Документ.Организация);
		
		ТаблицаДляВыгрузки = Запрос.Выполнить().Выгрузить();
	Иначе
		ТаблицаДляВыгрузки = ТекущийОбъект.ПодобраннаяНоменклатура.Выгрузить();
	КонецЕсли;
	
	АдресРезультатаПодбораВХранилище = ПоместитьВоВременноеХранилище(ТаблицаДляВыгрузки, УникальныйИдентификатор);
	
	Возврат АдресРезультатаПодбораВХранилище;
	
КонецФункции

&НаКлиенте
Процедура ПодобраннаяНоменклатураПриИзменении(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя = "ПодобраннаяНоменклатураКоличество" ИЛИ Элемент.ТекущийЭлемент.Имя = "ПодобраннаяНоменклатураЦена" Тогда
		Элемент.ТекущиеДанные.Сумма = Элемент.ТекущиеДанные.Количество * Элемент.ТекущиеДанные.Цена;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	МассивНовыхСтрок = Новый Массив;
	
	МассивПереносимойНоменклатуры = ПараметрыПеретаскивания.Значение;
	
	Для Каждого ЭлементМассива Из МассивПереносимойНоменклатуры Цикл
		
		Элементы.СписокНоменклатуры.ТекущаяСтрока = ЭлементМассива;
		
		ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
		
		МассивХарактеристик = ПолучитьМассивХарактеристикНоменклатуры(ТекущиеДанные.Ссылка);
		
		Если Элементы.СписокНоменклатуры.ТекущиеДанные.Свойство("Цена") Тогда
			Если МассивХарактеристик.Количество() = 0 Тогда
				МассивНовыхСтрок.Добавить(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, Количество, Цена, Сумма",ТекущиеДанные.Ссылка,ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"),1,ТекущиеДанные.Цена,ТекущиеДанные.Цена));
			Иначе
				Для Каждого ЭлементМассиваХарактеристик Из МассивХарактеристик Цикл
					МассивНовыхСтрок.Добавить(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, Количество, Цена, Сумма",ТекущиеДанные.Ссылка,ЭлементМассиваХарактеристик,1,ТекущиеДанные.Цена,ТекущиеДанные.Цена));
				КонецЦикла;
			КонецЕсли;
		Иначе
			Если МассивХарактеристик.Количество() = 0 Тогда
				МассивНовыхСтрок.Добавить(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, Количество",ТекущиеДанные.Ссылка,ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка"),1));
			Иначе
				Для Каждого ЭлементМассиваХарактеристик Из МассивХарактеристик Цикл
					МассивНовыхСтрок.Добавить(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, Количество",ТекущиеДанные.Ссылка,ЭлементМассиваХарактеристик,1));
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ЭлементМассиваНовыхСтрок Из МассивНовыхСтрок Цикл
		
		НайденныеСтроки = Объект.ПодобраннаяНоменклатура.НайтиСтроки(НОВЫЙ Структура("Номенклатура, ХарактеристикаНоменклатуры",ЭлементМассиваНовыхСтрок.Номенклатура,ЭлементМассиваНовыхСтрок.ХарактеристикаНоменклатуры));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			ТекущаяСтрока = Объект.ПодобраннаяНоменклатура.Добавить();
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока,ЭлементМассиваНовыхСтрок);
		Иначе
			ТекущаяСтрока 				= НайденныеСтроки[0]; 
			ТекущаяСтрока.Количество 	= ТекущаяСтрока.Количество + 1;
			ТекущаяСтрока.Сумма 		= ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ МассивНовыхСтрок.Количество() = 0 Тогда
		
		Элементы.ПодобраннаяНоменклатура.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивХарактеристикНоменклатуры(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХарактеристикиНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец",Номенклатура);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура СписокХарактеристикОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	МассивНовыхСтрок = Новый Массив;
	
	МассивПереносимойНоменклатуры = ПараметрыПеретаскивания.Значение;
	
	Для Каждого ЭлементМассива Из МассивПереносимойНоменклатуры Цикл
		
		Элементы.СписокХарактеристик.ТекущаяСтрока = ЭлементМассива;
		ТекущиеДанные = Элементы.СписокХарактеристик.ТекущиеДанные;
		
		Элементы.СписокНоменклатуры.ТекущаяСтрока = ТекущиеДанные.Владелец;
		ТекущиеДанныеНоменклатура = Элементы.СписокНоменклатуры.ТекущиеДанные;
		
		Если Элементы.СписокНоменклатуры.ТекущиеДанные.Свойство("Цена") Тогда
			МассивНовыхСтрок.Добавить(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, Количество, Цена, Сумма",ТекущиеДанные.Владелец,ЭлементМассива,1,ТекущиеДанныеНоменклатура.Цена,ТекущиеДанныеНоменклатура.Цена));
		Иначе
			МассивНовыхСтрок.Добавить(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, Количество",ТекущиеДанные.Владелец,ЭлементМассива,1));
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ЭлементМассиваНовыхСтрок Из МассивНовыхСтрок Цикл
		
		НайденныеСтроки = Объект.ПодобраннаяНоменклатура.НайтиСтроки(НОВЫЙ Структура("Номенклатура, ХарактеристикаНоменклатуры",ЭлементМассиваНовыхСтрок.Номенклатура,ЭлементМассиваНовыхСтрок.ХарактеристикаНоменклатуры));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			ТекущаяСтрока = Объект.ПодобраннаяНоменклатура.Добавить();
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока,ЭлементМассиваНовыхСтрок);
		Иначе
			ТекущаяСтрока 				= НайденныеСтроки[0]; 
			ТекущаяСтрока.Количество 	= ТекущаяСтрока.Количество + 1;
			ТекущаяСтрока.Сумма 		= ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ МассивНовыхСтрок.Количество() = 0 Тогда
		
		Элементы.ПодобраннаяНоменклатура.ТекущаяСтрока = ТекущаяСтрока.ПолучитьИдентификатор();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборТолькоВНаличии() Экспорт
	
	// Для списка номенклатуры.
	ГруппаОтбораТолькоВНаличииНоменклатура = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		ЭтаФорма.СписокНоменклатуры.Отбор.Элементы,
		"ГруппаТолькоВНаличии",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтбораТолькоВНаличииНоменклатура,
		"Остаток",
		0,
		ВидСравненияКомпоновкиДанных.Больше,
		,
		ЭтаФорма.ТолькоВНаличии);
	
	// Для списка характеристик.
	ГруппаОтбораТолькоВНаличииХарактеристики = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		ЭтаФорма.СписокХарактеристик.Отбор.Элементы,
		"ГруппаТолькоВНаличии",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтбораТолькоВНаличииХарактеристики,
		"Остаток",
		0,
		ВидСравненияКомпоновкиДанных.Больше,
		,
		ЭтаФорма.ТолькоВНаличии);
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоВНаличииПриИзменении(Элемент)
	
	УстановитьОтборТолькоВНаличии();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКомплектующихПриАктивизацииСтроки(Элемент)
	
	Если ЭтаФорма.Элементы.СписокКомплектующих.ТекущаяСтрока = Неопределено Тогда
		ТекКомплектующее = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		//ТекКомплект = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"); 
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.СписокХарактеристик.Отбор, "Владелец", ТекущаяНоменклатура,ВидСравненияКомпоновкиДанных.Равно, "Владелец", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.СписокХарактеристикКомплектующих.Отбор, "Владелец", ТекКомплектующее, ВидСравненияКомпоновкиДанных.Равно, "Владелец", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.СписокНоменклатуры.Отбор, "Комплектующее", ТекКомплектующее, ВидСравненияКомпоновкиДанных.Равно, "Комплектующее", Ложь);
	Иначе
		Если ЗначениеЗаполнено(ЭтаФорма.Элементы.СписокКомплектующих.ТекущиеДанные.Номенклатура) Тогда
			ТекКомплектующее = ЭтаФорма.Элементы.СписокКомплектующих.ТекущиеДанные.Номенклатура;
			//ТекКомплект = ЭтаФорма.Элементы.СписокКомплектующих.ТекущиеДанные.Ссылка;
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.СписокХарактеристикКомплектующих.Отбор, "Владелец", ТекКомплектующее, ВидСравненияКомпоновкиДанных.Равно, "Владелец", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.СписокНоменклатуры.Отбор, "Комплектующее", ТекКомплектующее, ВидСравненияКомпоновкиДанных.Равно, "Комплектующее", Истина);
			СписокНоменклатурыПриАктивизацииСтроки(Элемент);
		Иначе
			ТекКомплектующее = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.СписокХарактеристикКомплектующих.Отбор, "Владелец", ТекКомплектующее, ВидСравненияКомпоновкиДанных.Равно, "Владелец", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭтаФорма.СписокНоменклатуры.Отбор, "Комплектующее", ТекКомплектующее, ВидСравненияКомпоновкиДанных.Равно, "Комплектующее", Ложь);
		КонецЕсли;
	КонецЕсли;
	
	ЭтаФорма.ТекКомплектующее = ТекКомплектующее;
	ЭтаФорма.ТекКомплект = ТекКомплект;
	
КонецПроцедуры
